# queno 1

# Creating pandas series

In [1]:
import pandas as pd

In [13]:
data=[4,18,15,16,23,42]
series=pd.Series(data)

In [14]:
series

0     4
1    18
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(series)

pandas.core.series.Series

In [5]:
list(series)

[4, 18, 15, 16, 23, 42]

In [ ]:
#so in the above we have created series and list of "series".

# queno 2

In [6]:
series=[3,5,6,89,78,65,67,45,76,67]
variable=pd.Series(series)

In [7]:
variable

0     3
1     5
2     6
3    89
4    78
5    65
6    67
7    45
8    76
9    67
dtype: int64

In [8]:
type(variable)

pandas.core.series.Series

In [9]:
variable.dtypes

dtype('int64')

In [10]:
list(variable)

[3, 5, 6, 89, 78, 65, 67, 45, 76, 67]

In [ ]:
#so in the same way we have taken variable named as variable and printed the series by using pandas.series Function().

# queno 3

In [12]:
data=[['Alice','25','Female'],['Bob','30','Male'],['Claire','27','Female']]

In [13]:
df=pd.DataFrame(data,columns=['Name','Age','Gender'])

In [14]:
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [15]:
df.set_index('Name')

       Age  Gender
Name
Alice   25  Female
Bob     30    Male
Claire  27  Female

In [ ]:
#So in this way we have printed dataframe having variable df by applying pd.dataframe function.

# queno 4

# DataFrame

In [ ]:
#DataFrame is a datastructure that organizes data into a 2-dimensional table of rows and columns,much like a spreadsheet.

In [ ]:
#It has many features like its size is mutable,has labelled axes and also can perform arithmetic operations on rows and columns.

In [ ]:
#In the other hand ther is one dimensional labelled array called Pandas Series may hold any form of data (integer,list,float,string)etc.

In [ ]:
#It is possible to create new series by using lists,arrays,dictionaries,and existing Series objects.

In [ ]:
#Pandas series can be aligned with another Series or DataFrame even if indsex labels are ordered differently while in dataframe alighnment is also supported but it is determined by coumn label.

In [ ]:
#Additional features like filtering,merging and joining is accesible in dataframe but not in Series.

In [16]:
data=[['Alice','25','Female'],['Bob','30','Male'],['Claire','27','Female']]

In [17]:
df=pd.DataFrame(data,columns=['Name','Age','Gender'])

In [18]:
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [19]:
df1=pd.Series(data)

In [20]:
df1

0     [Alice, 25, Female]
1         [Bob, 30, Male]
2    [Claire, 27, Female]
dtype: object

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
type(df1)

pandas.core.series.Series

In [ ]:
#so after converting dataframe in to series we have seen that dataframe has lost the columns after converting into series.

# queno 5

In [23]:
x=pd.read_excel("DATASCRAPPED.XLSX.xlsx")

In [24]:
df2=pd.DataFrame(x)

In [25]:
df2

,VIDEO.NO,VIDEO_URL,VIDEO_THUMBNAIL,VIDEO_VIEWS,VIDEO_TITLE,VIDEO_UPLOAD_DATE
0,1,https://www.youtube.com/watch?v=Hk38eamyEhc,https://i.ytimg.com/vi/Hk38eamyEhc/maxresdefau...,3666,"FEDERALISM in 30 mins || Class - 10TH Boards'""",2023-10-10T05:30:09-07:00
1,2,https://www.youtube.com/watch?v=3xcO-Uci14o,https://i.ytimg.com/vi/3xcO-Uci14o/maxresdefau...,16099,"ACIDS, BASES, AND SALTS in 55 mins || Class - ...",2023-10-09T05:30:02-07:00
2,3,https://www.youtube.com/watch?v=9psNUS-2Bow,https://i.ytimg.com/vi/9psNUS-2Bow/maxresdefau...,7277,SECTORS OF THE INDIAN ECONOMY in 40 mins || Cl...,2023-10-07T05:30:05-07:00
3,4,https://www.youtube.com/watch?v=Zyw6KS4myIY,https://i.ytimg.com/vi/Zyw6KS4myIY/maxresdefau...,8618,The Human Eye and the Colourful World in 30min...,2023-10-06T05:30:17-07:00
4,5,https://www.youtube.com/watch?v=fP0E43Y6ldI,https://i.ytimg.com/vi/fP0E43Y6ldI/maxresdefau...,8036,FOREST AND WILDLIFE RESOURCES in 40mins || Cl...,2023-10-05T05:30:33-07:00

In [26]:
df2.columns

Index(['VIDEO.NO', 'VIDEO_URL', 'VIDEO_THUMBNAIL', 'VIDEO_VIEWS',
       'VIDEO_TITLE', 'VIDEO_UPLOAD_DATE'],
      dtype='object')

In [27]:
list(df2.columns)

['VIDEO.NO',
 'VIDEO_URL',
 'VIDEO_THUMBNAIL',
 'VIDEO_VIEWS',
 'VIDEO_TITLE',
 'VIDEO_UPLOAD_DATE']

In [28]:
df2.dtypes

VIDEO.NO              int64
VIDEO_URL            object
VIDEO_THUMBNAIL      object
VIDEO_VIEWS           int64
VIDEO_TITLE          object
VIDEO_UPLOAD_DATE    object
dtype: object

In [29]:
df2[['VIDEO.NO','VIDEO_TITLE','VIDEO_UPLOAD_DATE','VIDEO_VIEWS']]

,VIDEO.NO,VIDEO_TITLE,VIDEO_UPLOAD_DATE,VIDEO_VIEWS
0,1,"FEDERALISM in 30 mins || Class - 10TH Boards'""",2023-10-10T05:30:09-07:00,3666
1,2,"ACIDS, BASES, AND SALTS in 55 mins || Class - ...",2023-10-09T05:30:02-07:00,16099
2,3,SECTORS OF THE INDIAN ECONOMY in 40 mins || Cl...,2023-10-07T05:30:05-07:00,7277
3,4,The Human Eye and the Colourful World in 30min...,2023-10-06T05:30:17-07:00,8618
4,5,FOREST AND WILDLIFE RESOURCES in 40mins || Cl...,2023-10-05T05:30:33-07:00,8036

In [ ]:
#So in the above we saw that we are able to remove column video_url and video_thumbnail and also rearrange the column in a new way.

# queno 6

In [ ]:
#The value in series is mutable means we can change any value in series ,but the size is immutable.

In [ ]:
#While in Dataframe size and data is mutable means we can change size and data at any time.

In [ ]:
#Panel is a three dimensional data structure with heterogenous data.

In [ ]:
#In panel both data and size are mutable.

In [44]:
index_=['mango','guava','banana','orange','cauliflower','cabbage']

In [45]:
series.index=index_

In [46]:
series

mango           4
guava          18
banana         15
orange         16
cauliflower    23
cabbage        42
dtype: int64

In [47]:
change=series.replace(to_replace=4,value=50)

In [48]:
change

mango          50
guava          18
banana         15
orange         16
cauliflower    23
cabbage        42
dtype: int64

In [ ]:
#so here we saw value of series mutating from 4 to 50.

In [49]:
df2

,VIDEO.NO,VIDEO_URL,VIDEO_THUMBNAIL,VIDEO_VIEWS,VIDEO_TITLE,VIDEO_UPLOAD_DATE
0,1,https://www.youtube.com/watch?v=Hk38eamyEhc,https://i.ytimg.com/vi/Hk38eamyEhc/maxresdefau...,3666,"FEDERALISM in 30 mins || Class - 10TH Boards'""",2023-10-10T05:30:09-07:00
1,2,https://www.youtube.com/watch?v=3xcO-Uci14o,https://i.ytimg.com/vi/3xcO-Uci14o/maxresdefau...,16099,"ACIDS, BASES, AND SALTS in 55 mins || Class - ...",2023-10-09T05:30:02-07:00
2,3,https://www.youtube.com/watch?v=9psNUS-2Bow,https://i.ytimg.com/vi/9psNUS-2Bow/maxresdefau...,7277,SECTORS OF THE INDIAN ECONOMY in 40 mins || Cl...,2023-10-07T05:30:05-07:00
3,4,https://www.youtube.com/watch?v=Zyw6KS4myIY,https://i.ytimg.com/vi/Zyw6KS4myIY/maxresdefau...,8618,The Human Eye and the Colourful World in 30min...,2023-10-06T05:30:17-07:00
4,5,https://www.youtube.com/watch?v=fP0E43Y6ldI,https://i.ytimg.com/vi/fP0E43Y6ldI/maxresdefau...,8036,FOREST AND WILDLIFE RESOURCES in 40mins || Cl...,2023-10-05T05:30:33-07:00

In [50]:
df2[['VIDEO.NO','VIDEO_TITLE','VIDEO_URL','VIDEO_THUMBNAIL']]

,VIDEO.NO,VIDEO_TITLE,VIDEO_URL,VIDEO_THUMBNAIL
0,1,"FEDERALISM in 30 mins || Class - 10TH Boards'""",https://www.youtube.com/watch?v=Hk38eamyEhc,https://i.ytimg.com/vi/Hk38eamyEhc/maxresdefau...
1,2,"ACIDS, BASES, AND SALTS in 55 mins || Class - ...",https://www.youtube.com/watch?v=3xcO-Uci14o,https://i.ytimg.com/vi/3xcO-Uci14o/maxresdefau...
2,3,SECTORS OF THE INDIAN ECONOMY in 40 mins || Cl...,https://www.youtube.com/watch?v=9psNUS-2Bow,https://i.ytimg.com/vi/9psNUS-2Bow/maxresdefau...
3,4,The Human Eye and the Colourful World in 30min...,https://www.youtube.com/watch?v=Zyw6KS4myIY,https://i.ytimg.com/vi/Zyw6KS4myIY/maxresdefau...
4,5,FOREST AND WILDLIFE RESOURCES in 40mins || Cl...,https://www.youtube.com/watch?v=fP0E43Y6ldI,https://i.ytimg.com/vi/fP0E43Y6ldI/maxresdefau...

In [55]:
df2['VIDEO_VIEWS']=df2['VIDEO_VIEWS'].replace([7277],10000)

In [56]:
df2

,VIDEO.NO,VIDEO_URL,VIDEO_THUMBNAIL,VIDEO_VIEWS,VIDEO_TITLE,VIDEO_UPLOAD_DATE
0,1,https://www.youtube.com/watch?v=Hk38eamyEhc,https://i.ytimg.com/vi/Hk38eamyEhc/maxresdefau...,3666,"FEDERALISM in 30 mins || Class - 10TH Boards'""",2023-10-10T05:30:09-07:00
1,2,https://www.youtube.com/watch?v=3xcO-Uci14o,https://i.ytimg.com/vi/3xcO-Uci14o/maxresdefau...,16099,"ACIDS, BASES, AND SALTS in 55 mins || Class - ...",2023-10-09T05:30:02-07:00
2,7,https://www.youtube.com/watch?v=9psNUS-2Bow,https://i.ytimg.com/vi/9psNUS-2Bow/maxresdefau...,10000,SECTORS OF THE INDIAN ECONOMY in 40 mins || Cl...,2023-10-07T05:30:05-07:00
3,4,https://www.youtube.com/watch?v=Zyw6KS4myIY,https://i.ytimg.com/vi/Zyw6KS4myIY/maxresdefau...,8618,The Human Eye and the Colourful World in 30min...,2023-10-06T05:30:17-07:00
4,5,https://www.youtube.com/watch?v=fP0E43Y6ldI,https://i.ytimg.com/vi/fP0E43Y6ldI/maxresdefau...,8036,FOREST AND WILDLIFE RESOURCES in 40mins || Cl...,2023-10-05T05:30:33-07:00

In [ ]:
#SO IN THIS DATA FRAME we have changed value from column video_views from 7277 to 10000.

# queno 7

In [15]:
series

0     4
1    18
2    15
3    16
4    23
5    42
dtype: int64

In [16]:
data=[5,7,8,54,34,65]
series1=pd.Series(data)

In [17]:
series1

0     5
1     7
2     8
3    54
4    34
5    65
dtype: int64

In [ ]:
#so here are two series series1 and series converting in to dataframe.

In [21]:
frame={'Entry':series,'Age':series1}

In [22]:
CONV_TO_DF=pd.DataFrame(frame)

In [23]:
CONV_TO_DF

   Entry  Age
0      4    5
1     18    7
2     15    8
3     16   54
4     23   34
5     42   65

In [ ]:
#so in this way we are able to covert series and series1 in to dataframe conv_to_df.